--Example usage of BinarySearchTreeHash--
ruby-1.9.2> h = BinarySearchTreeHash.new logger
 => {}
ruby-1.9.2> (1..100).each{|i| h[i] = i*1000}
 => 1..100
ruby-1.9.2> h[45]
  DEBUG - [03/May/2011 15:02:07] "find operation completed in 7 lookups..."
 => 45000
ruby-1.9.2> h[77]
  DEBUG - [03/May/2011 15:02:14] "find operation completed in 6 lookups..."
 => 77000
ruby-1.9.2> h[32]
  DEBUG - [03/May/2011 15:02:18] "find operation completed in 2 lookups..."
 => 32000
ruby-1.9.2> h.delete 32
  DEBUG - [03/May/2011 15:02:29] "find operation completed in 2 lookups..."
 => {1 => 1000, 2 => 2000, 3 => 3000, 4 => 4000, 5 => 5000, 6 => 6000, 7 => 7000, 8 => 8000, 9 => 9000, 10 => 10000, 11 => 11000, 12 => 12000, 13 => 13000, 14 => 14000, 15 => 15000, 16 => 16000, 17 => 17000, 18 => 18000, 19 => 19000, 20 => 20000, 21 => 21000, 22 => 22000, 23 => 23000, 24 => 24000, 25 => 25000, 26 => 26000, 27 => 27000, 28 => 28000, 29 => 29000, 30 => 30000, 31 => 31000, 33 => 33000, 34 => 34000, 35 => 35000, 36 => 36000, 37 => 37000, 38 => 38000, 39 => 39000, 40 => 40000, 41 => 41000, 42 => 42000, 43 => 43000, 44 => 44000, 45 => 45000, 46 => 46000, 47 => 47000, 48 => 48000, 49 => 49000, 50 => 50000, 51 => 51000, 52 => 52000, 53 => 53000, 54 => 54000, 55 => 55000, 56 => 56000, 57 => 57000, 58 => 58000, 59 => 59000, 60 => 60000, 61 => 61000, 62 => 62000, 63 => 63000, 64 => 64000, 65 => 65000, 66 => 66000, 67 => 67000, 68 => 68000, 69 => 69000, 70 => 70000, 71 => 71000, 72 => 72000, 73 => 73000, 74 => 74000, 75 => 75000, 76 => 76000, 77 => 77000, 78 => 78000, 79 => 79000, 80 => 80000, 81 => 81000, 82 => 82000, 83 => 83000, 84 => 84000, 85 => 85000, 86 => 86000, 87 => 87000, 88 => 88000, 89 => 89000, 90 => 90000, 91 => 91000, 92 => 92000, 93 => 93000, 94 => 94000, 95 => 95000, 96 => 96000, 97 => 97000, 98 => 98000, 99 => 99000, 100 => 100000}
ruby-1.9.2> h[32]
  DEBUG - [03/May/2011 15:02:58] "find operation completed in 8 lookups..."
 => nil
ruby-1.9.2> h[5000] = 7777
 => 7777
ruby-1.9.2> h[5000]
  DEBUG - [03/May/2011 15:03:33] "find operation completed in 7 lookups..."
 => 7777
ruby-1.9.2> h.size
 => 100
ruby-1.9.2> h.delete 50
  DEBUG - [03/May/2011 15:03:48] "find operation completed in 6 lookups..."
 => {1 => 1000, 2 => 2000, 3 => 3000, 4 => 4000, 5 => 5000, 6 => 6000, 7 => 7000, 8 => 8000, 9 => 9000, 10 => 10000, 11 => 11000, 12 => 12000, 13 => 13000, 14 => 14000, 15 => 15000, 16 => 16000, 17 => 17000, 18 => 18000, 19 => 19000, 20 => 20000, 21 => 21000, 22 => 22000, 23 => 23000, 24 => 24000, 25 => 25000, 26 => 26000, 27 => 27000, 28 => 28000, 29 => 29000, 30 => 30000, 31 => 31000, 33 => 33000, 34 => 34000, 35 => 35000, 36 => 36000, 37 => 37000, 38 => 38000, 39 => 39000, 40 => 40000, 41 => 41000, 42 => 42000, 43 => 43000, 44 => 44000, 45 => 45000, 46 => 46000, 47 => 47000, 48 => 48000, 49 => 49000, 51 => 51000, 52 => 52000, 53 => 53000, 54 => 54000, 55 => 55000, 56 => 56000, 57 => 57000, 58 => 58000, 59 => 59000, 60 => 60000, 61 => 61000, 62 => 62000, 63 => 63000, 64 => 64000, 65 => 65000, 66 => 66000, 67 => 67000, 68 => 68000, 69 => 69000, 70 => 70000, 71 => 71000, 72 => 72000, 73 => 73000, 74 => 74000, 75 => 75000, 76 => 76000, 77 => 77000, 78 => 78000, 79 => 79000, 80 => 80000, 81 => 81000, 82 => 82000, 83 => 83000, 84 => 84000, 85 => 85000, 86 => 86000, 87 => 87000, 88 => 88000, 89 => 89000, 90 => 90000, 91 => 91000, 92 => 92000, 93 => 93000, 94 => 94000, 95 => 95000, 96 => 96000, 97 => 97000, 98 => 98000, 99 => 99000, 100 => 100000, 5000 => 7777}
ruby-1.9.2> h.size
 => 99
